app/controllers/categories_controller.rb

SELECT * FROM "categories"
---
  def index
    @categories = Category.all

SELECT * FROM "categories" WHERE ("categories"."id" = 1)
---
  def show
    @category = Category.find(params[:id])

SELECT * FROM "categories" WHERE ("categories"."id" = 1)
---
  def edit
    @category = Category.find(params[:id])