app/controllers/property_accounts_controller.rb

  def index
    if user_is_admin?
      @property_accounts = PropertyAccount.find(:all)
    else
      @property_accounts = PropertyAccount.find_all_by_user_id(session[:current_user_id])
---
SELECT * FROM "property_accounts" WHERE ("property_accounts"."id" = 1)
SELECT * FROM "property_accounts" WHERE ("property_accounts"."user_id" = 2)

  def show
    @property_account = PropertyAccount.find(params[:id])
---
SELECT * FROM "property_accounts" WHERE ("property_accounts".user_id = 2)

  def edit
    @property_account = PropertyAccount.find(params[:id])
---
SELECT * FROM "property_accounts" WHERE ("property_accounts"."id" = 1)

  def create
    @property_account = PropertyAccount.new(params[:property_account])

    respond_to do |format|
      @property_account.user_id = session[:current_user_id]
      if @property_account.save
---
INSERT INTO "property_accounts" ("created_at", "number_of_bedrooms", "post_code", "updated_at", "user_id", "address_1", "property_type", "address_2", "nick_name", "address_3", "address_4") VALUES('2011-03-08 09:51:26', 1, '', '2011-03-08 09:51:26', 2, NULL, 'House', 'ttttttttt', 'ttttt', 'tttttttttttttt', 'Auckland')

  def update

    @property_account = PropertyAccount.find(params[:id])
    unless user_is_admin? || user_is_owner?(@property_account.user_id)
      flash[:error] = "The page you requested is for administrator only. Please sign in as administrator to continue."
      redirect_to :controller=>"users",:action=>"sign_in"
      return false
    end
    respond_to do |format|
      if @property_account.update_attributes(params[:property_account])
---
SELECT * FROM "property_accounts" WHERE ("property_accounts"."id" = 3)
UPDATE "property_accounts" SET "updated_at" = '2011-03-08 08:36:55', "nick_name" = 'eden apt' WHERE "id" = 3