app/controllers/transactions_controller.rb

  def index
    if session[:current_property_id].blank?
      flash[:error] = 'Please select an property account first.'
      redirect_to :controller=>'users',:action=>'show',:id=>session[:current_user_id]
    else
      unless params[:month].blank?
        @transactions = Transaction.find(:all, :conditions=>['property_account_id = ? and date_trunc(\'day\',date) LIKE ?',session[:current_property_id],"#{params[:month]}%"])
      else
        @transactions = Transaction.find_all_by_property_account_id(session[:current_property_id])
      end
      @property = PropertyAccount.find(session[:current_property_id])
---
SELECT * FROM "transactions" WHERE (property_account_id = 1) ORDER BY date asc
SELECT * FROM "property_accounts" WHERE ("property_accounts"."id" = 1)

  def list
    date_from = "#{params[:search]['date_from(1i)']}-#{params[:search]['date_from(2i)'].length.eql?(1) ? '0' : ''}#{params[:search]['date_from(2i)']}-#{params[:search]['date_from(3i)'].length.eql?(1) ? '0' : ''}#{params[:search]['date_from(3i)']}"
    date_to = "#{params[:search]['date_to(1i)']}-#{params[:search]['date_to(2i)'].length.eql?(1) ? '0' : '' }#{params[:search]['date_to(2i)']}-#{params[:search]['date_to(3i)'].length.eql?(1) ? '0' : ''}#{params[:search]['date_to(3i)']}"

    type = params[:search][:type]

    @property = PropertyAccount.find(session[:current_property_id])
    if type.blank?
      @transactions = Transaction.find(:all, :conditions=>['(property_account_id = ?) and (date between ? and ?)',session[:current_property_id],date_from,date_to])
---
SELECT * FROM "property_accounts" WHERE ("property_accounts"."id" = 3)
SELECT * FROM "transactions" WHERE ((property_account_id = 3) and (date between '2011-03-12' and '2011-03-10'))

  def show
    @transaction = Transaction.find(params[:id])
---
SELECT * FROM "transactions" WHERE ("transactions"."id" = 5)

  def edit
    @transaction = Transaction.find(params[:id])
---
SELECT * FROM "transactions" WHERE ("transactions"."id" = 5)