app/controllers/users_controller.rb

  def index
    @users = User.all
---
SELECT * FROM "users"

  def show
    @user = User.find(params[:id])
---
SELECT * FROM "users" WHERE ("users"."id" = 2)

  def edit
    @user = User.find(params[:id])
---
SELECT * FROM "users" WHERE ("users"."id" = 2)

  def process_sign_in
    @user = User.find_by_email(params[:login][:email])
---
SELECT * FROM "users" WHERE ("users"."email" = 'vmt024@gmail.com') LIMIT 1